const Hero = () => {
  return (
    // กำหนดการแสดง Hero Component ทั้งหมดแบบ flex-row ถ้าเป็นหน้าจอขนาดกลางขึ้นมา
    // และเป็น flex-col ถ้าเป็นหน้าจอขนาดเล็ก เช่น มือถือ เป็นต้น
    <div className="hero">
      <div className={`flex md:flex-row flex-col`}>
        {/* กำหนดการแสดง Column ซ้ายมือ ได้แก่ ข้อความต่าง ๆ โดยถ้าเป็นหน้าจอขนาดเล็ก ให้ Add Margin Top 10 px */}
        <div className="flex flex-col justify-center ml-16 mr-6">
          {/* กำหนด Font, สีข้อความ ระยะห่างระหว่างบรรทัด (ss:leading) โดยถ้าเป็นหน้าจอขนาดปกติให้มีระยะห่างระหว่างบรรทัดเป็น 100.8px แต่ถ้าเป็นหน้าจอขนาดเล็กให้มีระยะห่างระหว่างบรรทัดเป็น 75px */}
          {/* และถ้าเป็นหน้าจอขนาดปกติให้ใช้ขนาดตัวอักษร 72 px แต่ถ้าเป็นหน้าจอขนาดเล็กให้ใช้ขนาดตัวอักษร 52 px */}
          <h1 className="font-semibold ss:text-[72px] text-[52px] ss:leading-[100.8px] leading-[75px] ">
            {/* กำหนดให้หลังข้อความ จองที่พัก ให้ขึ้นบรรทัดใหม่ในกรณีที่เป็น Small Device */}
            ค้นหา จองที่พัก <br className="sm:block hidden" />{" "}
            <span>ง่าย รวดเร็วสุด ๆ</span>{" "}
          </h1>

          {/* กำหนดให้แสดงข้อความ โดยใช้พื้นที่ 550px */}
          <p className={`font-light text-[20px] max-w-[550px]`}>
            เว็บไซต์ของเราใช้วิธีการแบบใหม่ในการระบุที่พักซึ่งน่าจะตรงกับความต้องการของคุณมากที่สุด
          </p>
        
        </div>
      </div>
    </div>
  );
};

export default Hero